{
  "header": {
    "name": "Welcome!",
    "description": "Hi! I'm Avinash. All the progress in machine learning has made me rethink my goal of becoming a 'learning machine'. Until I find a new answer to what to do with my life, I am spending time reading, building, and working with good people. I enjoy reading science, exploring abstract ideas, and I write occasionally."
    },
    "projects": [
    {
      "id": "learning_buddy",
      "title": "Learning Buddy",
      "image": "media/plapp.jpeg",
      "link": "project_template.html?id=learning_buddy",
      "tags": ["Gemini", "Apps Script"],
      "projectType": "personal",
      "upcoming": false,
      "description": "This project uses Google Apps Script to create a personal learning assistant that helps with enquiry-based learning and spaced repetition. It takes a .txt file and your reading pace as input, makes API calls to the Gemini 1.5 Flash API to generate questions based on the text, compiles the questions and answers in a Google Sheet, and sends you recent and old questions via email for effective learning.",
      "features": [
        "Accepts .txt files and reading pace as input.",
        "Generates questions using Gemini 1.5 Flash API based on the text content.",
        "Compiles questions and answers in a Google Sheet.",
        "Sends recent and old questions via email for spaced repetition and enquiry-based learning."
      ],
      "pseudo_code": "// High-Level Pseudo Code for Learning Buddy Project\n\n// Step 1: Read input text file and reading pace\nfunction processInput(file, pace) {\n    // Read the text content from the file\n    // Use the reading pace to determine the timing for questions\n}\n\n// Step 2: Generate questions using API\nfunction generateQuestions(text, pace) {\n    // Call Gemini 1.5 Flash API with the text and pace\n    // Retrieve generated questions from the API response\n}\n\n// Step 3: Store questions in Google Sheet\nfunction storeInGoogleSheet(questions) {\n    // Open or create a Google Sheet\n    // Save questions and answers in the sheet\n}\n\n// Step 4: Send questions via email\nfunction sendEmail(questions) {\n    // Compile recent questions for enquiry-based learning\n    // Compile old questions for spaced repetition\n    // Send the questions to the user via email\n}\n\n// Main Function to Coordinate the Steps\nfunction main() {\n    // Process input text file and reading pace\n    // Generate questions using API\n    // Store questions in Google Sheet\n    // Send questions via email\n}"
    },
    {
    "id": "cook_intuitively",
    "title": "Cook Intuitively",
    "image": "media/cooking.jpeg",
    "link": "project_template.html?id=cook_intuitively",
    "tags": ["Product", "Data"],
    "projectType": "work",
    "upcoming": false,
    "description": "This project helps users master the art of intuitive cooking. With a focus on teaching the 'why' behind each step, users can learn to cook without relying strictly on recipes. The project includes step-by-step video recipes, customizable plans to suit dietary needs and preferences, and a comprehensive approach to mastering ingredients and techniques.",
    "features": [
      "Learn as you cook: Master key cooking techniques and concepts as you follow a recipe.",
      "Adapts to you: Customize recipes to fit your dietary needs, preferences, and constraints.",
      "Step-by-Step Video Recipes: Follow along with easy-to-understand videos for each recipe.",
      "Personalized Cooking Plan: Get a tailored plan for what to cook based on your tastes and skill level.",
      "Master One, Cook Many: Cook 20+ dishes from a single master recipe.",
      "Learn the Concept: Understand the 'why' behind each step to learn to cook intuitively.",
      "Master Ingredients: Learn how to bring out the best in each ingredient.",
      "Culinary Mastery: Discover the secrets to cook like Grandma, from key principles to personalizing recipes with ease."
    ]
    },
    {
      "id": "this_portfolio",
      "title": "This Portfolio",
      "image": "media/portfolio.jpeg",
      "link": "project_template.html?id=this_portfolio",
      "projectType": "personal",
      "upcoming": true,
      "tags": ["JavaScript", "GPT-4o"],
      "description": "I have been struggling to put together a website because of logistics - I am not a dev/designer. I am a PM. PMs don't really work lol. Jokes apart, things like setting up a database, hosting the project, and making sure you have assets always led to delaying this project. GPT-4o enters the chat (quite literally)! I asked GPT-4o that I wanted to put a one pager on GitHub to showcase my projects, and that led to this! There is a main index.html that references a bunch of content from content.json and other <project>.html files. It took me 4 hours to put everything together, and I am amazed by GPT-4o's (and in general all other LLMs') performance and cost.",
      "features": [
        "Quick setup and deployment with GitHub Pages.",
        "Uses content.json to manage project details.",
        "Dynamic content loading with JavaScript and JSON.",
        "Responsive design for mobile and desktop.",
        "Seamless integration of project-specific HTML templates."
      ],
      "pseudo_code": "// High-Level Pseudo Code for Portfolio Project\n\n// Step 1: Initialize project\nfunction initializeProject() {\n    // Setup project structure\n    // Prepare assets and content files\n}\n\n// Step 2: Create index.html\nfunction createIndexHtml() {\n    // Reference content from content.json\n    // Link to project-specific HTML files\n}\n\n// Step 3: Populate content from content.json\nfunction populateContent() {\n    // Fetch data from content.json\n    // Populate index.html and project pages with data\n}\n\n// Step 4: Setup hosting\nfunction setupHosting() {\n    // Choose a hosting platform (e.g., GitHub Pages)\n    // Deploy the project to the chosen platform\n}\n\n// Main Function to Coordinate the Steps\nfunction main() {\n    // Initialize project\n    initializeProject();\n    // Create index.html\n    createIndexHtml();\n    // Populate content\n    populateContent();\n    // Setup hosting\n    setupHosting();\n}"
    }
  ],
  "skills": [
    {
      "category": "Data & Scripting",
      "items": [
        { "name": "Python", "rating": 4},
        { "name": "Google Apps Script", "rating": 4 },
        { "name": "SQL", "rating": 4 },
        { "name": "Clevertap", "rating": 4 },
        { "name": "Metabase", "rating": 5 },
        { "name": "Data Studio", "rating": 5 },
        { "name": "Web Automation", "rating": 3 }
        
      ]
    },
    {
      "category": "Cross Functional",
      "items": [
        { "name": "User Research", "rating": 4 },
        { "name": "Teaching & Mentoring", "rating": 5 }
        
      ]
    },
    {
      "category": "Others",
      "items": [
        { "name": "Machine learning", "rating": 3 },
        { "name": "Visible Light Communication", "rating": 3 },
        { "name": "Sensor Fusion", "rating": 3 }
      ]
    }

  ],
  "experience": [
    {
      "company": "Better Ed Co, Bangalore",
      "position": "Product Manager",
      "duration": "May 2022 - Present",
      "description": "Leading product work at cooking.app to help you become confident home cooks. Apart from leading product efforts for our learning product, I also led analytics across all products in the organization. I have been tinkering with and embedding LLMs in product workflows."
    },
    {
      "company": "Cuemath, Bangalore",
      "position": "Associate Product Manager",
      "duration": "Apr 2021 - Apr 2022",
      "description": "Developed an alternate sales strategy as a quick experiment for the US/International market. Improved trial class request to teacher slot matching from 75% to 88% on platform and to 94% off platform using rigorous data analytics. Enhanced feedback and input response rate from roughly 25% (via WhatsApp, max reach ~50 teachers) to 65% (on platform, max reach - all active teachers)."
    }
  ],
  "education": [
    {
      "institution": "Indian Institute of Technology Delhi",
      "duration": "Jul 2016 - Jun 2020",
      "degree": "Bachelor of Technology in Electrical, Electronics and Communications Engineering",
      "projects": [
        {
          "title": "Visible Light Communication",
          "description": "Devised a new coding-decoding scheme for flicker mitigation over a 5kbps data-rate. Enhanced the scheme to support dimming over a 60% intensity band, limiting flickering statistically. Simulated existing modulation schemes to match BER, BW, and PSD with theoretical results. Derived PSDs analytically and numerically for various coding schemes."
        },
        {
          "title": "Autonomous Robots - DL1234",
          "description": "Implemented vision-based localization using Logitech webcam and OpenCV's Aruco Marker-based libraries. Developed and implemented a sensor fusion model based on the Extended Kalman Filter (EKF) to improve robot localization. Used OptiTrack Motive to track robot motion and compare regular odometry-based pose with EKF-based estimated pose."
        }
      ]
    }
  ],
  "volunteer": [
    {
      "organization": "NSS IIT Delhi",
      "position": "Teacher Grade 8-12",
      "duration": "Aug 2016 - Sep 2017",
      "description": "One of my students qualified JEE Mains and ended up joining DTU."
    }
  ],
  "awards": [
    {
      "title": "Karmaveer Global Young Leaders Fellow",
      "organization": "TCC-REX | UN | IITD",
      "date": "Oct 2019"
    },
    {
      "title": "IITD Semester Merit Award",
      "organization": "IIT Delhi",
      "date": "May 2017"
    }
  ]
}
